jpwright/hackny-hardware-workshop/boards.txt
adafruit.menu.usb.serial.name=Serial
adafruit.menu.usb.serial.build.define0=-DUSB_SERIAL

adafruit.menu.usb.hid.name=Keyboard + Mouse
adafruit.menu.usb.hid.build.define0=-DUSB_HID
adafruit.menu.usb.hid.fake_serial=teensy_gateway

adafruit.menu.usb.int_disk.name=Disk(Internal) + Keyboard
adafruit.menu.usb.int_disk.build.define0=-DUSB_DISK
adafruit.menu.usb.int_disk.fake_serial=teensy_gateway
adafruit.menu.usb.int_disk.build.elfpatch=mktinyfat

adafruit.menu.usb.sd_disk.name=Disk(SD Card) + Keyboard
adafruit.menu.usb.sd_disk.build.define0=-DUSB_DISK_SDFLASH
adafruit.menu.usb.sd_disk.fake_serial=teensy_gateway

adafruit.menu.speed.16.name=16 MHz
adafruit.menu.speed.8.name=8 MHz
adafruit.menu.speed.4.name=4 MHz
adafruit.menu.speed.2.name=2 MHz
adafruit.menu.speed.1.name=1 MHz
adafruit.menu.speed.16.build.f_cpu=16000000L
adafruit.menu.speed.8.build.f_cpu=8000000L
adafruit.menu.speed.4.build.f_cpu=4000000L
adafruit.menu.speed.2.build.f_cpu=2000000L
adafruit.menu.speed.1.build.f_cpu=1000000L
adafruit.menu.keys.en-us.name=US English
adafruit.menu.keys.en-us.build.define1=-DLAYOUT_US_ENGLISH
adafruit.menu.keys.fr-ca.name=Canadian French
adafruit.menu.keys.fr-ca.build.define1=-DLAYOUT_CANADIAN_FRENCH
adafruit.menu.keys.xx-ca.name=Canadian Multilingual
adafruit.menu.keys.xx-ca.build.define1=-DLAYOUT_CANADIAN_MULTILINGUAL
adafruit.menu.keys.da-da.name=Danish
adafruit.menu.keys.da-da.build.define1=-DLAYOUT_DANISH
adafruit.menu.keys.fi-fi.name=Finnish
adafruit.menu.keys.fi-fi.build.define1=-DLAYOUT_FINNISH
adafruit.menu.keys.fr-fr.name=French
adafruit.menu.keys.fr-fr.build.define1=-DLAYOUT_FRENCH
adafruit.menu.keys.fr-be.name=French Belgian
adafruit.menu.keys.fr-be.build.define1=-DLAYOUT_FRENCH_BELGIAN
adafruit.menu.keys.fr-ch.name=French Swiss
adafruit.menu.keys.fr-ch.build.define1=-DLAYOUT_FRENCH_SWISS
adafruit.menu.keys.de-de.name=German
adafruit.menu.keys.de-de.build.define1=-DLAYOUT_GERMAN
adafruit.menu.keys.de-dm.name=German (Mac)
adafruit.menu.keys.de-dm.build.define1=-DLAYOUT_GERMAN_MAC
adafruit.menu.keys.de-ch.name=German Swiss
adafruit.menu.keys.de-ch.build.define1=-DLAYOUT_GERMAN_SWISS
adafruit.menu.keys.is-is.name=Icelandic
adafruit.menu.keys.is-is.build.define1=-DLAYOUT_ICELANDIC
adafruit.menu.keys.en-ie.name=Irish
adafruit.menu.keys.en-ie.build.define1=-DLAYOUT_IRISH
adafruit.menu.keys.it-it.name=Italian
adafruit.menu.keys.it-it.build.define1=-DLAYOUT_ITALIAN
adafruit.menu.keys.no-no.name=Norwegian
adafruit.menu.keys.no-no.build.define1=-DLAYOUT_NORWEGIAN
adafruit.menu.keys.pt-pt.name=Portuguese
adafruit.menu.keys.pt-pt.build.define1=-DLAYOUT_PORTUGUESE
adafruit.menu.keys.pt-br.name=Portuguese Brazilian
adafruit.menu.keys.pt-br.build.define1=-DLAYOUT_PORTUGUESE_BRAZILIAN
adafruit.menu.keys.es-es.name=Spanish
adafruit.menu.keys.es-es.build.define1=-DLAYOUT_SPANISH
adafruit.menu.keys.es-mx.name=Spanish Latin America
adafruit.menu.keys.es-mx.build.define1=-DLAYOUT_SPANISH_LATIN_AMERICA
adafruit.menu.keys.sv-se.name=Swedish
adafruit.menu.keys.sv-se.build.define1=-DLAYOUT_SWEDISH
adafruit.menu.keys.en-gb.name=United Kingdom
adafruit.menu.keys.en-gb.build.define1=-DLAYOUT_UNITED_KINGDOM
adafruit.menu.keys.usint.name=US International
adafruit.menu.keys.usint.build.define1=-DLAYOUT_US_INTERNATIONAL